# Download

In [3]:
from urllib.request import urlretrieve

In [4]:
db_url = 'https://github.com/lerocha/chinook-database/raw/master/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite'

In [5]:
urlretrieve(db_url, 'chinook.sqlite')

('chinook.sqlite', <http.client.HTTPMessage at 0x1add7738b90>)

# Interact with the database by writing SQL queries

In [6]:
!pip install ipython-sql --quiet --upgrade
!pip install sqlalchemy --quiet --upgrade

In [7]:
%load_ext sql

In [8]:
%%sql 

sqlite:///chinook.sqlite

In [9]:
%%sql 

SELECT * FROM Artist LIMIT 5

 * sqlite:///chinook.sqlite
Done.

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains')]

In [10]:
%%sql 

SELECT * FROM Album LIMIT 5

 * sqlite:///chinook.sqlite
Done.

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

# Assignment

## Selection and Ordering

> **QUESTION 1**: Write a SQL query to sort the rows from the table Track in alphabetical order of Track name and display the first 10 rows.

In [11]:
%%sql

SELECT * FROM Track LIMIT 10

 * sqlite:///chinook.sqlite
Done.

[(1, 'For Those About To Rock (We Salute You)', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 343719, 11170334, 0.99),
 (2, 'Balls to the Wall', 2, 2, 1, None, 342562, 5510424, 0.99),
 (3, 'Fast As a Shark', 3, 2, 1, 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 230619, 3990994, 0.99),
 (4, 'Restless and Wild', 3, 2, 1, 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 252051, 4331779, 0.99),
 (5, 'Princess of the Dawn', 3, 2, 1, 'Deaffy & R.A. Smith-Diesel', 375418, 6290521, 0.99),
 (6, 'Put The Finger On You', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 205662, 6713451, 0.99),
 (7, "Let's Get It Up", 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 233926, 7636561, 0.99),
 (8, 'Inject The Venom', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 210834, 6852860, 0.99),
 (9, 'Snowballed', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 203102, 6599424, 0.99),
 (10, 'Evil Walks', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 263497, 8611245, 0.99)]

Write a SQL query to show the next 10 rows based on the above criteria.

In [13]:
%%sql

SELECT * FROM Track LIMIT 10 offset 10

 * sqlite:///chinook.sqlite
Done.

[(11, 'C.O.D.', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 199836, 6566314, 0.99),
 (12, 'Breaking The Rules', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 263288, 8596840, 0.99),
 (13, 'Night Of The Long Knives', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 205688, 6706347, 0.99),
 (14, 'Spellbound', 1, 1, 1, 'Angus Young, Malcolm Young, Brian Johnson', 270863, 8817038, 0.99),
 (15, 'Go Down', 4, 1, 1, 'AC/DC', 331180, 10847611, 0.99),
 (16, 'Dog Eat Dog', 4, 1, 1, 'AC/DC', 215196, 7032162, 0.99),
 (17, 'Let There Be Rock', 4, 1, 1, 'AC/DC', 366654, 12021261, 0.99),
 (18, 'Bad Boy Boogie', 4, 1, 1, 'AC/DC', 267728, 8776140, 0.99),
 (19, 'Problem Child', 4, 1, 1, 'AC/DC', 325041, 10617116, 0.99),
 (20, 'Overdose', 4, 1, 1, 'AC/DC', 369319, 12066294, 0.99)]

## Counting

> **QUESTION 2**: Write a SQL query to calculate the total number of employees working at Chinook.

In [14]:
%%sql

select count(employeeId) from Employee

 * sqlite:///chinook.sqlite
Done.

[(8,)]

Write SQL queries to calculate the total number customers, total number of artists and total number of tracks in the database.

In [16]:
%%sql

select count(customerId) from Customer

 * sqlite:///chinook.sqlite
Done.

[(59,)]

In [17]:
%%sql

select count(ArtistId) from Artist

 * sqlite:///chinook.sqlite
Done.

[(275,)]

In [18]:
%%sql

select count(TrackId) from Track

 * sqlite:///chinook.sqlite
Done.

[(3503,)]

## Aggregation and Grouping

> **QUESTION 3**: Write a SQL query to show the top 10 albums with the highest number of tracks. The result should contain 2 columns: album ID and number of tracks in the album (name the column "Tracks"). Here are the first few rows of the result:
> <img src="https://i.imgur.com/0vGhVMZ.png" width="120">

In [21]:
%%sql

SELECT a.AlbumId, COUNT(t.TrackId) AS Tracks
FROM Album a
JOIN Track t ON t.AlbumId = a.AlbumId
GROUP BY a.AlbumId
ORDER BY Tracks DESC
LIMIT 10

 * sqlite:///chinook.sqlite
Done.

[(141, 57),
 (23, 34),
 (73, 30),
 (229, 26),
 (230, 25),
 (251, 25),
 (83, 24),
 (231, 24),
 (253, 24),
 (24, 23)]

Improve the above query to also show the album name, artist ID and artist name. Enter the updated query in the empty cell below.

In [22]:
%%sql

select a.AlbumId, count(t.TrackId) as Tracks, a.Title, ar.ArtistId, ar.Name as Artist
from Album a
join Track t on a.AlbumId = t.AlbumId
join Artist ar on a.ArtistId = ar.ArtistId
group by a.AlbumId
order by Tracks desc
limit 10;

 * sqlite:///chinook.sqlite
Done.

[(141, 57, 'Greatest Hits', 100, 'Lenny Kravitz'),
 (23, 34, 'Minha Historia', 17, 'Chico Buarque'),
 (73, 30, 'Unplugged', 81, 'Eric Clapton'),
 (229, 26, 'Lost, Season 3', 149, 'Lost'),
 (230, 25, 'Lost, Season 1', 149, 'Lost'),
 (251, 25, 'The Office, Season 3', 156, 'The Office'),
 (83, 24, 'My Way: The Best Of Frank Sinatra [Disc 1]', 85, 'Frank Sinatra'),
 (231, 24, 'Lost, Season 2', 149, 'Lost'),
 (253, 24, 'Battlestar Galactica (Classic), Season 1', 158, 'Battlestar Galactica (Classic)'),
 (24, 23, 'Afrociberdelia', 18, 'Chico Science & Nação Zumbi')]

 List the top 10 albums with the highest number of tracks.

In [23]:
%%sql

SELECT a.AlbumId, COUNT(t.TrackId) AS Tracks
FROM Album a
JOIN Track t ON a.AlbumId = t.AlbumId
GROUP BY a.AlbumId
ORDER BY Tracks DESC
LIMIT 10;

 * sqlite:///chinook.sqlite
Done.

[(141, 57),
 (23, 34),
 (73, 30),
 (229, 26),
 (230, 25),
 (251, 25),
 (83, 24),
 (231, 24),
 (253, 24),
 (24, 23)]

List the top 10 artists with the highest number of tracks.

In [24]:
%%sql

SELECT ar.Name, COUNT(t.TrackId) AS Tracks
FROM Album a
JOIN Track t ON a.AlbumId = t.AlbumId
JOIN Artist ar ON a.ArtistId = ar.ArtistId
GROUP BY ar.ArtistId
ORDER BY Tracks DESC
LIMIT 10

 * sqlite:///chinook.sqlite
Done.

[('Iron Maiden', 213),
 ('U2', 135),
 ('Led Zeppelin', 114),
 ('Metallica', 112),
 ('Lost', 92),
 ('Deep Purple', 92),
 ('Pearl Jam', 67),
 ('Lenny Kravitz', 57),
 ('Various Artists', 56),
 ('The Office', 53)]

## Functions and Joins

> **QUESTION 4**: Show a list of the top 10 customer with the highest total spend in 2012. Calculate the total amount spent by each customer by adding the totals from all their invoices in the year 2012. Order the list by the invoice total (decreasing order). The result should contain the rows CustomerId, FirstName, LastName and TotalSpend. Here are the first few rows of the result:
> <img src="https://i.imgur.com/rayPKc3.png" width="480">
>
>
> *Note*: SQLite doesn't support the `YEAR` function. Instead use `strftime("%Y", Invoice.InvoiceDate)` to extract the year from the column `InvoiceDate` as a string. [Learn more.](https://www.w3resource.com/sqlite/sqlite-strftime.php)
>
> _Hint_: First try to write down a step-by-step solution to the problem in plain English, and then try to convert it to a SQL query. Use the empty cells below to experiment with intermediate queries.

In [27]:
%%sql

select c.CustomerId, c.FirstName, c.LastName, sum(i.Total) as TotalSpend
from Customer c
join Invoice i on c.CustomerId = i.CustomerId
where strftime('%Y', i.InvoiceDate) = '2012'
group by c.CustomerId
order by TotalSpend desc
limit 10;

 * sqlite:///chinook.sqlite
Done.

[(26, 'Richard', 'Cunningham', 25.84),
 (34, 'João', 'Fernandes', 24.77),
 (13, 'Fernanda', 'Ramos', 24.75),
 (51, 'Joakim', 'Johansson', 24.75),
 (55, 'Mark', 'Taylor', 22.77),
 (5, 'František', 'Wichterlová', 18.84),
 (43, 'Isabelle', 'Mercier', 18.84),
 (28, 'Julia', 'Barnett', 17.88),
 (22, 'Heather', 'Leacock', 17.84),
 (24, 'Frank', 'Ralston', 15.88)]

## Joins and Arithmetic Operations

> **QUESTION 5**: Write a SQL query to show the total number of albums and the average number of tracks per album for every artist. The result should include the artist ID, artist's name, total albums (name the column "Albums") and average tracks per album (name the column "TracksPerAlbum"). Sort the results in alphabetical order of artist name. Here are the first few rows of the result:
>
> <img src="https://i.imgur.com/WAE7oOx.png" width="640">
> 
> *Hint*: While dividing two integers, multiply one of the numbers by 1.0 to convert them into floats. [Learn more.](https://stackoverflow.com/questions/8305613/converting-int-to-real-in-sqlite)

In [61]:
%%sql

SELECT ar.ArtistId, ar.Name AS Artist, COUNT(a.AlbumId) AS Albums, AVG(t.TrackCount) AS TracksPerAlbum
FROM Artist ar
JOIN Album a ON ar.ArtistId = a.ArtistId
JOIN (
    SELECT AlbumId, COUNT(TrackId) AS TrackCount
    FROM Track
    GROUP BY AlbumId
) t ON a.AlbumId = t.AlbumId
GROUP BY ar.ArtistId, ar.Name
ORDER BY ar.Name ASC
limit 10;

 * sqlite:///chinook.sqlite
Done.

[(1, 'AC/DC', 2, 9.0),
 (230, 'Aaron Copland & London Symphony Orchestra', 1, 1.0),
 (202, 'Aaron Goldberg', 1, 1.0),
 (214, 'Academy of St. Martin in the Fields & Sir Neville Marriner', 1, 2.0),
 (215, 'Academy of St. Martin in the Fields Chamber Ensemble & Sir Neville Marriner', 1, 1.0),
 (222, 'Academy of St. Martin in the Fields, John Birch, Sir Neville Marriner & Sylvia McNair', 1, 1.0),
 (257, 'Academy of St. Martin in the Fields, Sir Neville Marriner & Thurston Dart', 1, 1.0),
 (2, 'Accept', 2, 2.0),
 (260, 'Adrian Leaper & Doreen de Feis', 1, 1.0),
 (3, 'Aerosmith', 1, 15.0)]

## Joining Multiple Tables

> **QUESTION 6:** Show the following information for all the tracks by the Artist "Metallica": Track ID, Track Name, Album Title, Artist Name, Composer, Media Type, Genre and track length in milliseconds. Order the tracks in alphabetical order of album names.
> 
> Here are the first few rows of the expected result:
>
> <img src="https://i.imgur.com/Ovhm9Nh.png" width="640">

In [69]:
%%sql

SELECT t.TrackId, t.Name AS TrackName, a.Title AS AlbumTitle, ar.Name AS ArtistName, t.Composer, m.Name AS MediaType, g.Name AS Genre, t.Milliseconds
FROM Track t 
JOIN Album a ON t.AlbumId = a.AlbumId
JOIN Artist ar ON a.ArtistId = ar.ArtistId
JOIN MediaType m ON t.MediaTypeId = m.MediaTypeId
JOIN Genre g ON t.GenreId = g.GenreId
WHERE ar.Name = 'Metallica'
ORDER BY a.Title ASC
limit 10;

 * sqlite:///chinook.sqlite
Done.

[(1893, 'Blackened', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Jason Newsted', 'MPEG audio file', 'Metal', 403382),
 (1894, '...And Justice For All', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Kirk Hammett', 'MPEG audio file', 'Metal', 585769),
 (1895, 'Eye Of The Beholder', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Kirk Hammett', 'MPEG audio file', 'Metal', 385828),
 (1896, 'One', '...And Justice For All', 'Metallica', 'James Hetfield & Lars Ulrich', 'MPEG audio file', 'Metal', 446484),
 (1897, 'The Shortest Straw', '...And Justice For All', 'Metallica', 'James Hetfield and Lars Ulrich', 'MPEG audio file', 'Metal', 395389),
 (1898, 'Harvester Of Sorrow', '...And Justice For All', 'Metallica', 'James Hetfield and Lars Ulrich', 'MPEG audio file', 'Metal', 345547),
 (1899, 'The Frayed Ends Of Sanity', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Kirk Hammett', 'MPEG audio file', 'Metal', 464039),
 (1900, 'To Live Is To Die', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Cliff Burton', 'MPEG audio file', 'Metal', 588564),
 (1901, 'Dyers Eve', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Kirk Hammett', 'MPEG audio file', 'Metal', 313991),
 (1801, 'Enter Sandman', 'Black Album', 'Metallica', 'James Hetfield, Lars Ulrich and Kirk Hammett', 'MPEG audio file', 'Metal', 332251)]

Modify the above query to show the length of each track in the "MM:SS" format i.e. "03:15". Enter the updated query in the empty cell below.

In [70]:
%%sql

SELECT t.TrackId, t.Name AS TrackName, a.Title AS AlbumTitle, ar.Name AS ArtistName, t.Composer, m.Name AS MediaType, g.Name AS Genre, 
    strftime('%M:%S', t.Milliseconds / 1000, 'unixepoch') AS TrackLength
FROM Track t 
JOIN Album a ON t.AlbumId = a.AlbumId
JOIN Artist ar ON a.ArtistId = ar.ArtistId
JOIN MediaType m ON t.MediaTypeId = m.MediaTypeId
JOIN Genre g ON t.GenreId = g.GenreId
WHERE ar.Name = 'Metallica'
ORDER BY a.Title ASC
LIMIT 10;

 * sqlite:///chinook.sqlite
Done.

[(1893, 'Blackened', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Jason Newsted', 'MPEG audio file', 'Metal', '06:43'),
 (1894, '...And Justice For All', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Kirk Hammett', 'MPEG audio file', 'Metal', '09:45'),
 (1895, 'Eye Of The Beholder', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Kirk Hammett', 'MPEG audio file', 'Metal', '06:25'),
 (1896, 'One', '...And Justice For All', 'Metallica', 'James Hetfield & Lars Ulrich', 'MPEG audio file', 'Metal', '07:26'),
 (1897, 'The Shortest Straw', '...And Justice For All', 'Metallica', 'James Hetfield and Lars Ulrich', 'MPEG audio file', 'Metal', '06:35'),
 (1898, 'Harvester Of Sorrow', '...And Justice For All', 'Metallica', 'James Hetfield and Lars Ulrich', 'MPEG audio file', 'Metal', '05:45'),
 (1899, 'The Frayed Ends Of Sanity', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Kirk Hammett', 'MPEG audio file', 'Metal', '07:44'),
 (1900, 'To Live Is To Die', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Cliff Burton', 'MPEG audio file', 'Metal', '09:48'),
 (1901, 'Dyers Eve', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Kirk Hammett', 'MPEG audio file', 'Metal', '05:13'),
 (1801, 'Enter Sandman', 'Black Album', 'Metallica', 'James Hetfield, Lars Ulrich and Kirk Hammett', 'MPEG audio file', 'Metal', '05:32')]

Modify the above query to include the total revenue from the sales of each track. Enter the updated query in the empty cell below.

In [71]:
%%sql

SELECT t.TrackId, t.Name AS TrackName, a.Title AS AlbumTitle, ar.Name AS ArtistName, t.Composer, m.Name AS MediaType, g.Name AS Genre, 
    strftime('%M:%S', t.Milliseconds / 1000, 'unixepoch') AS TrackLength, 
    SUM(il.UnitPrice * il.Quantity) AS TotalRevenue
FROM Track t 
JOIN Album a ON t.AlbumId = a.AlbumId
JOIN Artist ar ON a.ArtistId = ar.ArtistId
JOIN MediaType m ON t.MediaTypeId = m.MediaTypeId
JOIN Genre g ON t.GenreId = g.GenreId
JOIN InvoiceLine il ON t.TrackId = il.TrackId
GROUP BY t.TrackId
ORDER BY a.Title ASC
LIMIT 10;

 * sqlite:///chinook.sqlite
Done.

[(1893, 'Blackened', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Jason Newsted', 'MPEG audio file', 'Metal', '06:43', 0.99),
 (1894, '...And Justice For All', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Kirk Hammett', 'MPEG audio file', 'Metal', '09:45', 0.99),
 (1895, 'Eye Of The Beholder', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich & Kirk Hammett', 'MPEG audio file', 'Metal', '06:25', 0.99),
 (1898, 'Harvester Of Sorrow', '...And Justice For All', 'Metallica', 'James Hetfield and Lars Ulrich', 'MPEG audio file', 'Metal', '05:45', 0.99),
 (1899, 'The Frayed Ends Of Sanity', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Kirk Hammett', 'MPEG audio file', 'Metal', '07:44', 0.99),
 (1900, 'To Live Is To Die', '...And Justice For All', 'Metallica', 'James Hetfield, Lars Ulrich and Cliff Burton', 'MPEG audio file', 'Metal', '09:48', 0.99),
 (3290, 'The Zoo', '20th Century Masters - The Millennium Collection: The Best of Scorpions', 'Scorpions', None, 'Protected AAC audio file', 'Rock', '05:32', 0.99),
 (3291, 'Loving You Sunday Morning', '20th Century Masters - The Millennium Collection: The Best of Scorpions', 'Scorpions', None, 'Protected AAC audio file', 'Rock', '05:39', 0.99),
 (3292, 'Still Loving You', '20th Century Masters - The Millennium Collection: The Best of Scorpions', 'Scorpions', None, 'Protected AAC audio file', 'Rock', '06:30', 0.99),
 (3296, "I Can't Explain", '20th Century Masters - The Millennium Collection: The Best of Scorpions', 'Scorpions', None, 'Protected AAC audio file', 'Rock', '03:25', 0.99)]

## Table Creation  and Foreign Keys

> **QUESTION 7**: Create a new table `HallOfFame` to track the list of artists who have been added into the Chinook Hall of Fame. The table should contain three columns: 
>
> 1. `HallOfFameId` (int): Primary key with [Auto Increment](https://www.sqlite.org/autoinc.html)
> 2. `ArtistId` (int): Foreign key (from the Artist table)
> 3. `YearAdded` (int): The year the artist was added to the hall of fame 
>
> Once created, add 5 entries to the table (any artists of your choice).

In [72]:
%%sql

-- Create the HallOfFame table
CREATE TABLE HallOfFame (
    HallOfFameId INTEGER PRIMARY KEY AUTOINCREMENT,
    ArtistId INTEGER,
    YearAdded INTEGER,
    FOREIGN KEY (ArtistId) REFERENCES Artist(ArtistId)
);

-- Insert 5 entries into the HallOfFame table
INSERT INTO HallOfFame (ArtistId, YearAdded) VALUES (1, 2020);
INSERT INTO HallOfFame (ArtistId, YearAdded) VALUES (2, 2018);
INSERT INTO HallOfFame (ArtistId, YearAdded) VALUES (3, 2019);
INSERT INTO HallOfFame (ArtistId, YearAdded) VALUES (4, 2021);
INSERT INTO HallOfFame (ArtistId, YearAdded) VALUES (5, 2017);

 * sqlite:///chinook.sqlite
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [73]:
%%sql

SELECT * FROM HallOfFame JOIN Artist ON HallOfFame.ArtistId=Artist.ArtistId

 * sqlite:///chinook.sqlite
Done.

[(1, 1, 2020, 1, 'AC/DC'),
 (2, 2, 2018, 2, 'Accept'),
 (3, 3, 2019, 3, 'Aerosmith'),
 (4, 4, 2021, 4, 'Alanis Morissette'),
 (5, 5, 2017, 5, 'Alice In Chains')]

## Inserting Data into Tables

> **QUESTION 8**: Write SQL queries to insert the following records into the database:
> 
> 1. A new artist called "Linkin Park"
> 2. Two new albums for the artist Linkin Park:
>     1. Hybrid Theory
>     2. Meteora
> 3. Six new tracks (come up with sensible values for columns like Composer, Milliseconds etc.):
>     1. Papercut (in the album Hybrid Theory)
>     2. In The End (in the album Hybrid Theory)
>     3. Crawling (in the album Hybrid Theory)
>     4. Somewhere I Belong (in the album Meteora)
>     5. Numb (in the album Meteora)
>     6. Breaking the Habit (in the album Meteora)
>
> *Hint*: You need not provide a value for the ID (primary key) columns while inserting these rows, because the ID columns are marked as [AUTO INCREMENT](https://www.sqlite.org/autoinc.html) and will automatically be assigned the next available numeric value.

In [76]:
%%sql

-- 1. Insert a new artist called "Linkin Park":
INSERT INTO Artist (Name) VALUES ('Linkin Park');

-- 2. Insert two new albums for the artist Linkin Park:
INSERT INTO Album (Title, ArtistId) VALUES ('Hybrid Theory', (SELECT ArtistId FROM Artist WHERE Name = 'Linkin Park'));
INSERT INTO Album (Title, ArtistId) VALUES ('Meteora', (SELECT ArtistId FROM Artist WHERE Name = 'Linkin Park'));

-- 3. Insert six new tracks:
-- Insert tracks for the album 'Hybrid Theory'
INSERT INTO Track (Name, AlbumId, Composer, Milliseconds) VALUES ('Papercut', (SELECT AlbumId FROM Album WHERE Title = 'Hybrid Theory'), 'Linkin Park', 198000);
INSERT INTO Track (Name, AlbumId, Composer, Milliseconds) VALUES ('In The End', (SELECT AlbumId FROM Album WHERE Title = 'Hybrid Theory'), 'Linkin Park', 216000);
INSERT INTO Track (Name, AlbumId, Composer, Milliseconds) VALUES ('Crawling', (SELECT AlbumId FROM Album WHERE Title = 'Hybrid Theory'), 'Linkin Park', 211000);

-- Insert tracks for the album 'Meteora'
INSERT INTO Track (Name, AlbumId, Composer, Milliseconds) VALUES ('Somewhere I Belong', (SELECT AlbumId FROM Album WHERE Title = 'Meteora'), 'Linkin Park', 229000);
INSERT INTO Track (Name, AlbumId, Composer, Milliseconds) VALUES ('Numb', (SELECT AlbumId FROM Album WHERE Title = 'Meteora'), 'Linkin Park', 186000);
INSERT INTO Track (Name, AlbumId, Composer, Milliseconds) VALUES ('Breaking the Habit', (SELECT AlbumId FROM Album WHERE Title = 'Meteora'), 'Linkin Park', 197000);

 * sqlite:///chinook.sqlite
1 rows affected.
1 rows affected.
1 rows affected.
(sqlite3.IntegrityError) NOT NULL constraint failed: Track.MediaTypeId
[SQL: -- 3. Insert six new tracks:
-- Insert tracks for the album 'Hybrid Theory'
INSERT INTO Track (Name, AlbumId, Composer, Milliseconds) VALUES ('Papercut', (SELECT AlbumId FROM Album WHERE Title = 'Hybrid Theory'), 'Linkin Park', 198000);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [77]:
%%sql

SELECT * FROM Artist WHERE Name="Linkin Park"

 * sqlite:///chinook.sqlite
Done.

[(276, 'Linkin Park')]

In [78]:
%%sql

SELECT * FROM Album JOIN Artist on Album.ArtistId=Artist.ArtistId WHERE Artist.Name="Linkin Park"

 * sqlite:///chinook.sqlite
Done.

[(348, 'Hybrid Theory', 276, 276, 'Linkin Park'),
 (349, 'Meteora', 276, 276, 'Linkin Park')]

In [79]:
%%sql

SELECT * 
    FROM Track JOIN Album
    ON Track.AlbumId=Album.AlbumId
    JOIN Artist
    ON Album.ArtistId=Artist.ArtistId 
    WHERE Artist.Name="Linkin Park"

 * sqlite:///chinook.sqlite
Done.

[]